"CIAdditionCompositing" = "Dodatek";
"CIAffineClamp" = "Granica afiniczna";
"CIAffineTile" = "Mozaika afiniczna";
"CIAffineTransform" = "Transformacja afiniczna";
"CIBarsSwipeTransition"="Odwracane rolety";
"CIBlendWithMask" = "Połączenie z maską";
"CIBloom" = "Kwitnąco";
"CIBoxBlur"="Rozmycie sześcienne";
"CIBumpDistortion" = "Podbicie";
"CIBumpDistortionLinear"="Podbicie liniowe";
"CICMYKHalftone" = "Półtony CMYK";
"CICheckerboardGenerator" = "Szachownica";
"CICircleSplashDistortion" = "Kropla wody";
"CICircularScreen" = "Okrągły ekran";
"CICircularWrap" = "Owinięcie wokoło";
"CIColorControls" = "Kontrola kolorów";
"CIColorCube" = "Sześcian kolorów";
"CIColorInvert" = "Inwersja kolorów";
"CIColorMap" = "Mapa kolorów";
"CIColorMatrix" = "Matryca kolorów";
"CIColorMonochrome" = "Kolor monochromatyczny";
"CIColorPosterize" = "Posteryzacja";
"CIComicEffect" = "Efekt komiksowy";
"CIConstantColorGenerator" = "Stały kolor";
"CICopyMachineTransition" = "Kserokopiarka";
"CICrop" = "Kadruj";
"CICrystallize" = "Krystalizacja";
"CIDiscBlur"="Rozmycie kołowe";
"CIDisintegrateWithMaskTransition" = "Przejście z maską";
"CIDisplacementDistortion" = "Przeniesienie";
"CIDissolveTransition" = "Rozpuszczanie";
"CIDotScreen" = "Wzór kropek";
"CIEdges" = "Krawędzie";
"CIEdgeWork" = "Zmiana krawędzi";
"CIEightfoldReflectedTile"="Ośmiokątna płytka zwierciadlana";
"CIExposureAdjust" = "Dostosowanie ekspozycji";
"CIFalseColor" = "Fałszywe kolory";
"CIFastBoxBlur" = "Szybkie rozmycie sześcienne";
"CIFastDiscBlur" = "Szybkie rozmycie kołowe";
"CIFlashTransition" = "Rozbłysk";
"CIFourfoldReflectedTile"="Czterokątna płytka zwierciadlana";
"CIFourfoldRotatedTile"="Czterokątna obrócona płytka";
"CIFourfoldTranslatedTile"="Czterokątna przetworzona płytka";
"CIGammaAdjust" = "Zmiana gamma";
"CIGaussianBlur" = "Rozmycie gaussowskie";
"CIGaussianGradient" = "Gradient gaussowski";
"CIGlassDistortion" = "Zniekształcenie w szkle";
"CIGlassLozenge" = "Szklany romb";
"CIGlideReflectedTile"="Przesuwana mozaika zwierciadlana";
"CIGloom" = "Ponuro";
"CIHatchedScreen" = "Zakreskowanie";
"CIHeightFieldFromMask" = "Pole wysokości z maski";
"CIHexagonalPixellate"="Pikselizacja sześciokątna";
"CIHoleDistortion" = "Zniekształcenie przez otwór";
"CIHueAdjust" = "Dostosowanie barwy";
"CIKaleidoscope" = "Kalejdoskop";
"CILanczosScaleTransform" = "Skalowanie algorytmem Lanczosa";
"CILenticularHaloGenerator" = "Poświata soczewki";
"CILineOverlay" = "Nałożenie linii";
"CILineScreen" = "Linie";
"CILinearGradient" = "Gradient liniowy";
"CIMaskToAlpha" = "Maska do kanału alfa";
"CIMaximumCompositing" = "Maksymalna";
"CIMedianFilter" = "Mediana";
"CIMinimumCompositing" = "Minimum";
"CIModTransition" = "Mod";
"CIMotionBlur" = "Rozmycie w ruchu";
"CIMultiplyCompositing" = "Zwielokrotnienie";
"CINoiseReduction" = "Redukcja szumu";
"CIOpTile" = "Mozaika-op";
"CIPageCurlTransition" = "Odwrócenie strony";
"CIParallelogramTile" = "Mozaika równoległoboczna";
"CIPerspectiveTile" = "Mozaika perspektywiczna";
"CIPerspectiveTransform" = "Transformacja perspektywiczna";
"CIPinchDistortion" = "Ściśnięcie";
"CIPixellate" = "Pikselacja";
"CIPointillize" = "Punktylizacja";
"CIRadialGradient" = "Gradient promienisty";
"CIRandomGenerator" = "Generator losowy";
"CIRippleTransition" = "Fala";
"CISepiaTone" = "Tony sepii";
"CIShadedMaterial" = "Cieniowany materiał";
"CISharpenLuminance" = "Wyostrzenie luminancji";
"CISixfoldReflectedTile"="Sześciokątna mozaika zwierciadlana";
"CISixfoldRotatedTile"="Sześciokątna obrócona mozaika";
"CISourceAtopCompositing" = "Źródło na";
"CISourceInCompositing" = "Źródło w";
"CISourceOutCompositing" = "Źródło poza";
"CISourceOverCompositing" = "Źródło ponad";
"CISpotColor" = "Kolor reflektora";
"CISpotLight" = "Reflektor";
"CIStarShineGenerator" = "Gwiazdy";
"CIStripesGenerator" = "Paski";
"CISunbeamsGenerator" = "Promienie słońca";
"CISwipeTransition" = "Odwracanie";
"CITorusLensDistortion" = "Zniekształcenie soczewką pierścieniową";
"CITriangleTile" = "Trójkątna mozaika";
"CITwelvefoldReflectedTile"="Dwunastokątna mozaika zwierciadlana";
"CITwirlDistortion" = "Zniekształcenie obrotowe";
"CIUnsharpMask" = "Maska wyostrzająca";
"CIVortexDistortion" = "Zniekształcenie wirowe";
"CIWhitePointAdjust" = "Dostosowanie punktu bieli";
"CIZoomBlur" = "Rozmycie zoom";
"CIColorBlendMode" = "Tryb mieszania kolorów";
"CIColorBurnBlendMode" = "Tryb wypalania i mieszania kolorów";
"CIColorDodgeBlendMode" = "Tryb rozjaśnienia i mieszania kolorów";
"CIDarkenBlendMode" = "Tryb przyciemnienia i mieszania kolorów";
"CIDifferenceBlendMode" = "Tryb różnicowania i mieszania kolorów";
"CIExclusionBlendMode" = "Tryb wyłączenia i mieszania kolorów";
"CIHardLightBlendMode" = "Tryb mieszania silnego światła";
"CIHueBlendMode" = "Tryb mieszania barwy";
"CILightenBlendMode" = "Tryb rozjaśniania i mieszania kolorów";
"CILuminosityBlendMode" = "Tryb mieszania jaskrawości";
"CIMultiplyBlendMode" = "Tryb mnożenia i mieszania kolorów";
"CIOverlayBlendMode" = "Tryb nakładania i mieszania kolorów";
"CISaturationBlendMode" = "Tryb mieszania nasycenia";
"CIScreenBlendMode" = "Ekranowy tryb mieszania";
"CISoftLightBlendMode" = "Tryb zmiękczania światła i mieszania kolorów";
"CIAreaHistogram" = "Histogram obszaru";
"CIAreaMaximum" = "Maksimum obszaru";
"CIAreaMinimum" = "Minimum obszaru";
"CIAreaMaximumAlpha" = "Maksymalna alfa obszaru";
"CIAreaMinimumAlpha" = "Minimalna alfa obszaru";
"CIAreaAverage" = "Średnia obszaru";
"CIRowAverage" = "Średnia dla wiersza";
"CIColumnAverage" = "Średnia dla kolumny";
"CIMinimumComponent" = "Minimalny składnik";
"CIMaximumComponent" = "Maksymalny składnik";
